[
    {
        "id": "110cd29c-948a-4204-9209-ac4a07b45b37",
        "name": "Sistema de Recomendación de Películas (Apache Spark ALS & Docker)",
        "description_short": "Desarrollo de Sistema de Recomendación (Apache Spark ALS & Docker): \r\nDiseñé y construí un sistema de recomendación de películas utilizando PySpark y el algoritmo ALS sobre el dataset MovieLens 25M. Superé desafíos de memoria como OutOfMemoryError mediante muestreo de datos y garantice la consistencia y persistencia del modelo al empaquetar la solución en Docker, demostrando habilidades en procesamiento de Big Data, Machine Learning, contenerización y resolución de problemas.",
        "description_full": "Proyecto: Sistema de Recomendación de Películas (Apache Spark ALS & Docker)\r\nEste proyecto abarca el diseño y la implementación de un sistema de recomendación de películas robusto y escalable, utilizando tecnologías de Big Data y Machine Learning. El objetivo principal fue construir un modelo capaz de sugerir películas personalizadas a los usuarios basándose en sus preferencias y comportamientos pasados.\r\nTecnologías Clave Utilizadas:\r\n•\tApache Spark (PySpark): Empleado como motor de procesamiento distribuido para manejar eficientemente el gran volumen de datos del dataset.\r\n•\tAlgoritmo ALS (Alternating Least Squares): Implementado a través de la librería Spark MLlib para la factorización matricial, ideal para sistemas de recomendación con datos dispersos (muchos usuarios que han valorado pocas películas).\r\n•\tDocker: Utilizado para empaquetar la aplicación completa, incluyendo todas sus dependencias, asegurando un entorno de ejecución consistente y portable.\r\nDetalles y Desafíos Superados:\r\n1.\tProcesamiento de Big Data con Spark:\r\no\tTrabajé con el extenso dataset MovieLens 25M, que contiene 25 millones de calificaciones de 62.000 películas por 162.000 usuarios.\r\no\tUtilicé PySpark para la ingesta, limpieza y preparación de estos datos a gran escala, transformándolos en el formato adecuado para el algoritmo ALS.\r\n2.\tModelado de Machine Learning (ALS):\r\no\tSe aplicó el algoritmo ALS, un método de factorización matricial ampliamente utilizado en sistemas de recomendación colaborativos. Este algoritmo aprende patrones latentes en las interacciones usuario-ítem para predecir calificaciones no observadas y generar recomendaciones personalizadas.\r\no\tAjusté y validé los parámetros del modelo (ej., rango, regularización, iteraciones) para optimizar la precisión de las recomendaciones.\r\n3.\tGestión de Memoria y Rendimiento:\r\no\tDurante el desarrollo, me enfrenté al desafío crítico de los errores de memoria (OutOfMemoryError), comunes al trabajar con datasets tan grandes en entornos Spark.\r\no\tResolví estos problemas mediante la implementación de estrategias de muestreo de datos inteligentemente diseñadas que permitieron entrenar y evaluar el modelo de manera efectiva sin agotar los recursos del sistema, manteniendo la representatividad del dataset original.\r\n4.\tContenerización y Despliegue con Docker:\r\no\tPara garantizar la consistencia, portabilidad y reproducibilidad del entorno de ejecución, empaqueté toda la solución (código PySpark, dependencias de Python, configuración de Spark) en un contenedor Docker.\r\no\tEsto permite que cualquier persona pueda ejecutar el sistema de recomendación en cualquier máquina con Docker instalado, eliminando problemas de configuración de dependencias y asegurando que el modelo funcione como se espera en cualquier entorno.\r\no\tLa solución Docker incluye un script para el entrenamiento del modelo y la generación de recomendaciones, facilitando la orquestación y el despliegue.\r\nResultados y Aprendizajes:\r\nEl proyecto culminó con un sistema de recomendación funcional capaz de generar sugerencias de películas personalizadas. La experiencia en este proyecto consolidó mis habilidades en:\r\n•\tProcesamiento distribuido de Big Data con Apache Spark.\r\n•\tImplementación y optimización de algoritmos de Machine Learning para sistemas de recomendación.\r\n•\tResolución de problemas complejos relacionados con la gestión de recursos (memoria) en entornos de Big Data.\r\n•\tContenerización y MLOps básicos con Docker, asegurando el despliegue y la reproducibilidad de modelos de IA.\r\n",
        "filename_on_server": "110cd29c-948a-4204-9209-ac4a07b45b37.py",
        "original_filename": "main.py",
        "demo_url": null,
        "github_url": "https://github.com/Fr4nc15c0-C4l3r0/movie-recommender-spark-als",
        "report_url": null,
        "github_for_display": "github.com/Fr4nc15c0-C4l3r0/movie-recommender-spark-als"
    },
    {
        "id": "aae2f587-06e3-4606-8a3a-fdaaf059b86b",
        "name": "hola 2",
        "description": "dsfnsdñofnñsdofngñosdanfgñosdnfñlsd",
        "filename_on_server": "aae2f587-06e3-4606-8a3a-fdaaf059b86b.py",
        "original_filename": "main.py",
        "demo_url": "sadfasdf",
        "github_url": "sadfsadfsadf",
        "report_url": "sdafsadfasdf",
        "github_for_display": "sadfsadfsadf"
    },
    {
        "id": "816ff218-764a-44f2-ab89-b36554043fb5",
        "name": "sadfasdfsadfsdaf",
        "description": "sdfasdfasdfasdfasdf",
        "filename_on_server": "816ff218-764a-44f2-ab89-b36554043fb5.rar",
        "original_filename": "logo_transparente-02.rar",
        "demo_url": null,
        "github_url": null,
        "report_url": null,
        "image_filename": "816ff218-764a-44f2-ab89-b36554043fb5_img.gif",
        "github_for_display": null
    },
    {
        "id": "bf43b1c7-2977-4e87-9659-e90ff1c3eee5",
        "name": "prueba de imagen",
        "description": "dsfsdvnñosdafgñoasdhfgñoaijhfgñoíewrajhlkasdsdajdnfnh dfpasdifas",
        "filename_on_server": "bf43b1c7-2977-4e87-9659-e90ff1c3eee5.rar",
        "original_filename": "logo_transparente-02.rar",
        "demo_url": "xbnvbcvbn",
        "github_url": "vbnvbnvbnvbn",
        "report_url": "xcvxcvxcvxc",
        "image_filename": "bf43b1c7-2977-4e87-9659-e90ff1c3eee5_img.jpg",
        "github_for_display": "vbnvbnvbnvbn"
    },
    {
        "id": "70b87922-e612-4cc7-9ba5-d93f3e92f5c2",
        "name": "prueba 0001",
        "description": "esta es otra prueba para subir proyectos",
        "filename_on_server": "70b87922-e612-4cc7-9ba5-d93f3e92f5c2.rar",
        "original_filename": "imagen_proyecto.rar",
        "demo_url": "no se si sale bien",
        "github_url": "asdisda",
        "report_url": "dosdjkf",
        "image_filename": "70b87922-e612-4cc7-9ba5-d93f3e92f5c2_img.jpg",
        "github_for_display": "asdisda"
    },
    {
        "id": "9570544e-75d3-4031-a0cb-efb1893e5db1",
        "name": "prueba 00002",
        "description": "erpertptrº",
        "filename_on_server": "9570544e-75d3-4031-a0cb-efb1893e5db1.rar",
        "original_filename": "imagen_proyecto.rar",
        "demo_url": "lkuibhn",
        "github_url": "oloih",
        "report_url": "ihoiioh",
        "image_filename": "9570544e-75d3-4031-a0cb-efb1893e5db1_img.png"
    }
]